Repository: abinoam/youtube_dlhelper
Catalog: docs/youtube_dlhelper/*/youtube_dlhelper.po
Languages: de_de

source: Introduction
de_de: Einführung

source: <productname>&PRODUCT;</productname> is a downloadhelper for Youtube.
de_de: <productname>&PRODUCT;</productname> ist ein Downloadhelfer für Youtube.

source: The installation works in the console/terminal via: <command>gem install hoe-reek</command>. Then just type <command>rake setup</command> to launch the setup.
de_de: Die Installation passiert in der Konsole/Terminal via: <command>gem install hoe-reek</command>. Dann tippen Sie: <command>rake setup</command> um das Setup zu starten.

source: Upgrading
de_de: Aktualisieren

source: <primary>Upgrading</primary>
de_de: <primary>Aktualisieren</primary>

source: If you have used an earlier version of <productname>&PRODUCT;</productname> please follow the next steps:
de_de: Falls Sie eine frühere Version von <productname>&PRODUCT;</productname> benutzt haben, folgen Sie den folgenden Schritten:

source: Go to the Console/Terminal and type:
de_de: Gehen Sie zur Konsole/Terminal und trippen Sie:

source: The Configfile
de_de: Die Konfigurationsdatei

source: <primary>Configfile</primary>
de_de: <primary>Konfigurationsdatei</primary>

source: The config file is located in <filename>/home/YOU/.config/youtube_dlhelper/youtube_dlhelper.conf</filename>. It looks like:
de_de: Die Konfigurationsdatei liegt in <filename>/home/YOU/.config/youtube_dlhelper/youtube_dlhelper.conf</filename>. Sie sieht wie folgt aus::

source: You have to set the name of your musicdir. In my case it is "Musik" and it is available in <filename>/home/sascha/Musik</filename>. If you set <emphasis role="bold">ogg_file_accept</emphasis> to true, the program tries to convert all to "MP3".
de_de: Sie vergeben den Namen Ihres Musikverzeichnisses. Tragen Sie "Musik" ein wenn ihr Verzeichnis in <filename>/home/sascha/Musik</filename> liegt. Falls <emphasis role="bold">ogg_file_accept</emphasis> zu true gesetzt ist, versucht das Programm, eine Konvertierung zu MP3.

source: Usage
de_de: Benutzung

source: <primary>Usage</primary>
de_de: <primary>Benutzung</primary>

source: After the installation you can just type <command>youtube_dlhelper YoutubeURL</command>. <example>youtube_dlhelper http://www.youtube.com/watch?v=aHjpOzsQ9YI</example>
de_de: Nach der Installation tippen Sie <command>youtube_dlhelper YoutubeURL</command>. <example>youtube_dlhelper http://www.youtube.com/watch?v=aHjpOzsQ9YI</example>

source: If a https:// URl doesn't works, try http://
de_de: Falls eine https:// URL nicht funktioniert, versuchen Sie http://.

source: After typing the program asks you if you adding a Interpret or a Group. If you choose Interpret it asks you for the firstname and the surname. So it creates a directory in <filename>$MUSICDIR/surname_firstname/Youtube</filename>. If you choose Group it uses the Groupname for creating the directory.
de_de: Dannach fragt das Programm, ob es ein Interpret oder eine Gruppe ist. Falls es ein Interpret ist, wird der Vorname und Nachname abgefragt. Anschließend wird ein Verzeichnis in <filename>$MUSICDIR/surname_firstname/Youtube</filename> erstellt. Liegt ein Interpret vor, wird der Gruppenname als Verzeichnisname benutzt.
